[
    {
        "plantId": 1,
        "plantName": "Snake Plant",
        "category": "Air Purifier",
        "price": "$18",
        "rating": 4.8,
        "availableStock": 10,
        "careLevel": "Easy",
        "description": "The Snake Plant, also known as Sansevieria or Mother-in-Law’s Tongue, is one of the most resilient indoor plants you can own. Its tall, upright leaves with striking variegation make it a stylish addition to any space. Beyond its beauty, this plant is a natural air purifier, known for filtering toxins like formaldehyde and benzene. It thrives in low light and tolerates neglect, making it perfect for beginners or busy plant owners.",
        "image": "https://i.ibb.co.com/QvKCjhFn/1.jpg",
        "providerName": "UrbanGreen Studio"
    },
    {
        "plantId": 2,
        "plantName": "Monstera Deliciosa",
        "category": "Tropical",
        "price": "$32",
        "rating": 4.9,
        "availableStock": 7,
        "careLevel": "Medium",
        "description": "The Monstera Deliciosa, also known as the Swiss Cheese Plant, is a tropical showstopper with large, glossy leaves that naturally split as the plant matures. Native to the rainforests of Central America, it brings lush, exotic vibes into any home. This plant loves bright, indirect light and moderate watering. It’s perfect for creating a bold, green statement while improving indoor air quality and humidity levels.",
        "image": "https://i.ibb.co.com/ZRpW9WgT/2.jpg",
        "providerName": "Leaf & Root Co."
    },
    {
        "plantId": 3,
        "plantName": "Peace Lily",
        "category": "Flowering",
        "price": "$22",
        "rating": 4.7,
        "availableStock": 15,
        "careLevel": "Easy",
        "description": "The Peace Lily is an elegant indoor plant that symbolizes tranquility and purification. It produces lush green foliage and beautiful white flowers that bloom throughout the year under the right conditions. Besides its aesthetic appeal, the Peace Lily is renowned for its ability to remove common indoor pollutants from the air. It thrives in moderate light and enjoys consistent moisture, making it a perfect companion for both homes and offices.",
        "image": "https://i.ibb.co.com/XZ1rg97J/3.jpg",
        "providerName": "NatureNest"
    },
    {
        "plantId": 4,
        "plantName": "ZZ Plant",
        "category": "Air Purifier",
        "price": "$25",
        "rating": 4.6,
        "availableStock": 12,
        "careLevel": "Very Easy",
        "description": "The ZZ Plant (Zamioculcas zamiifolia) is celebrated for its glossy green leaves and its nearly indestructible nature. It’s a true low-maintenance beauty that can thrive in almost any lighting condition, including dim spaces. This drought-tolerant plant stores water in its thick stems, so it only needs occasional watering. It’s perfect for frequent travelers, offices, or anyone looking for a hardy yet attractive plant that cleans the air effortlessly.",
        "image": "https://i.ibb.co.com/YvPRYFb/4.jpg",
        "providerName": "GreenHaus"
    },
    {
        "plantId": 5,
        "plantName": "Fiddle Leaf Fig",
        "category": "Indoor Tree",
        "price": "$48",
        "rating": 4.5,
        "availableStock": 5,
        "careLevel": "Medium",
        "description": "The Fiddle Leaf Fig is a striking indoor tree known for its broad, violin-shaped leaves that make an elegant statement in modern interiors. Native to West Africa, this plant prefers bright, filtered sunlight and consistent watering. It adds vertical interest and a touch of sophistication to living rooms, lobbies, or workspaces. With proper care, it can grow tall and lush, becoming a living piece of interior art.",
        "image": "https://i.ibb.co.com/h1f9rwM9/5.jpg",
        "providerName": "UrbanGreen Studio"
    },
    {
        "plantId": 6,
        "plantName": "Spider Plant",
        "category": "Air Purifier",
        "price": "$15",
        "rating": 4.8,
        "availableStock": 20,
        "careLevel": "Easy",
        "description": "The Spider Plant is one of the easiest and most forgiving indoor plants, making it perfect for first-time plant owners. With long, arching leaves and baby offshoots (often called ‘spiderettes’), it adds a lively, cascading look to shelves and hanging planters. It’s also a top performer in removing toxins like carbon monoxide and xylene from indoor air. Give it bright, indirect light and regular watering for the best growth.",
        "image": "https://i.ibb.co.com/nNKR3Q2H/6.jpg",
        "providerName": "Leaf & Root Co."
    },
    {
        "plantId": 7,
        "plantName": "Pothos Golden",
        "category": "Vine",
        "price": "$14",
        "rating": 4.9,
        "availableStock": 18,
        "careLevel": "Very Easy",
        "description": "The Pothos Golden is a beloved houseplant for its fast-growing, trailing vines and stunning heart-shaped leaves streaked with golden variegation. It’s almost impossible to kill and can thrive in a wide range of lighting conditions, from bright indirect light to low light corners. Pothos is also a powerful air purifier, making it both functional and decorative. Perfect for hanging baskets or shelves, it brings life and greenery to any room.",
        "image": "https://i.ibb.co.com/xtc6n1GD/7.jpg",
        "providerName": "NatureNest"
    },
    {
        "plantId": 8,
        "plantName": "Boston Fern",
        "category": "Fern",
        "price": "$20",
        "rating": 4.6,
        "availableStock": 9,
        "careLevel": "Medium",
        "description": "The Boston Fern is a lush, feathery plant that thrives in humid environments. Its vibrant green fronds add softness and movement to indoor spaces, making it ideal for bathrooms, kitchens, or shaded patios. This plant loves moisture and indirect light, rewarding consistent care with a full, graceful appearance. It’s also an effective air purifier that helps maintain a fresh and natural indoor atmosphere.",
        "image": "https://i.ibb.co.com/N2kT5P7p/8.jpg",
        "providerName": "GreenHaus"
    },
    {
        "plantId": 9,
        "plantName": "Rubber Plant",
        "category": "Indoor Tree",
        "price": "$30",
        "rating": 4.7,
        "availableStock": 8,
        "careLevel": "Medium",
        "description": "The Rubber Plant is a bold and striking houseplant featuring deep-green, glossy leaves that bring sophistication to any interior. Known for its sturdy growth and air-purifying qualities, it can grow into a small indoor tree with the right care. This plant prefers bright, indirect sunlight and moderate watering. Its minimalistic look complements modern and contemporary décor perfectly.",
        "image": "https://i.ibb.co.com/MkNw48P1/9.jpg",
        "providerName": "UrbanGreen Studio"
    },
    {
        "plantId": 10,
        "plantName": "Aloe Vera",
        "category": "Succulent",
        "price": "$12",
        "rating": 4.8,
        "availableStock": 25,
        "careLevel": "Easy",
        "description": "Aloe Vera is a well-known succulent celebrated for both its beauty and utility. Its fleshy green leaves contain a cooling gel used in skincare, healing, and home remedies. This plant thrives in bright light and requires minimal watering, making it ideal for busy plant lovers. Aloe Vera not only beautifies your space but also improves air quality while offering medicinal benefits right from your windowsill.",
        "image": "https://i.ibb.co.com/5gQvZ9wN/10.jpg",
        "providerName": "Leaf & Root Co."
    },
    {
        "plantId": 11,
        "plantName": "Chinese Money Plant",
        "category": "Foliage",
        "price": "$18",
        "rating": 4.7,
        "availableStock": 14,
        "careLevel": "Easy",
        "description": "The Chinese Money Plant, also known as Pilea Peperomioides, is admired for its unique round, coin-shaped leaves that symbolize wealth and prosperity. Its minimalist design makes it a favorite among modern plant enthusiasts. This plant thrives in bright, indirect sunlight and only needs occasional watering. It’s a conversation starter that brings good energy, luck, and greenery to desks and tabletops alike.",
        "image": "https://i.ibb.co.com/BVPCLbqT/11.jpg",
        "providerName": "NatureNest"
    },
    {
        "plantId": 12,
        "plantName": "Jade Plant",
        "category": "Succulent",
        "price": "$16",
        "rating": 4.5,
        "availableStock": 11,
        "careLevel": "Easy",
        "description": "The Jade Plant, often called the ‘Money Tree’, is a classic succulent that symbolizes growth, prosperity, and friendship. Its plump, oval leaves and woody stems give it the appearance of a miniature tree. Extremely low maintenance, it thrives on bright light and sparse watering. Perfect for sunny windowsills or office desks, this long-living plant is believed to bring positivity and good fortune to its owners.",
        "image": "https://i.ibb.co.com/GfLhMW4L/12.jpg",
        "providerName": "GreenHaus"
    }
]